# -*- coding: utf-8 -*-
"""
Created on Sat Jun  1 14:42:49 2019

@author: Tang
"""

'''
题目描述


给定一个数组和滑动窗口的大小，找出所有滑动窗口里数值的最大值。例如，
如果输入数组{2,3,4,2,6,2,5,1}及滑动窗口的大小3，那么一共存在6个滑动窗口，
他们的最大值分别为{4,4,6,6,6,5}； 针对数组{2,3,4,2,6,2,5,1}的滑动窗口有以下6个：
 {[2,3,4],2,6,2,5,1}， {2,[3,4,2],6,2,5,1}， {2,3,[4,2,6],2,5,1}， {2,3,4,[2,6,2],5,1}， 
 {2,3,4,2,[6,2,5],1}， {2,3,4,2,6,[2,5,1]}。
 '''
def solution(a,k):
     res=[]
     for i in range(len(a)-k+1):
          tmp=a[i:i+k]
          res.append(max(tmp))
     return res
print(solution([2,3,4,2,6,2,5,1],3))
     